Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <name>FM33FH0XX</name>
  <version>1.0</version>
  <description>FM33FH0XX</description>
  <cpu>
    <name>SC000</name>
    <revision>r1p0</revision>
    <endian>little</endian>
    <mpuPresent>False</mpuPresent>
    <fpuPresent>False</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>False</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x0</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>ADC</name>
      <description>ADC module information</description>
      <groupName>ADC</groupName>
      <headerStructName>ADC</headerStructName>
      <baseAddress>0x4001AC00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x108</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ACQ_ISR</name>
          <displayName>ACQ_ISR</displayName>
          <description>ACQ_ISR Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>OVID</name>
                <description>OVID field description</description>
                <bitOffset>17</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>OVRIF</name>
                <description>OVRIF field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SOCIF</name>
                <description>SOCIF field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EOCIF</name>
                <description>EOCIF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_IER</name>
          <displayName>ACQ_IER</displayName>
          <description>ACQ_IER Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>OVRIE</name>
                <description>OVRIE field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SOCIE</name>
                <description>SOCIE field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EOCIE</name>
                <description>EOCIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GISR</name>
          <displayName>GISR</displayName>
          <description>GISR Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x1F00</resetValue>
          <fields>
            <field>
                <name>SCAN_CH</name>
                <description>SCAN_CH field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ACQ_ID</name>
                <description>ACQ_ID field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>AWD_AH</name>
                <description>AWD_AH field description</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>AWD_UL</name>
                <description>AWD_UL field description</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ADEN</name>
                <description>ADEN field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>BUSY</name>
                <description>BUSY field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>EOCNT</name>
                <description>EOCNT field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>EOS</name>
                <description>EOS field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GIER</name>
          <displayName>GIER</displayName>
          <description>GIER Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>AWD_AHIE</name>
                <description>AWD_AHIE field description</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>AWD_ULIE</name>
                <description>AWD_ULIE field description</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EOCNT_IE</name>
                <description>EOCNT_IE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EOSIE</name>
                <description>EOSIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DUMMY</name>
                <description>DUMMY field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>CR1 Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>ACQEN</name>
                <description>ACQEN field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SCH_SWRST</name>
                <description>SCH_SWRST field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
            </field>
            <field>
                <name>RR_SWRST</name>
                <description>RR_SWRST field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
            </field>
            <field>
                <name>ADEN</name>
                <description>ADEN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <displayName>CR2</displayName>
          <description>CR2 Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>SWTRIG</name>
                <description>SWTRIG field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR1</name>
          <displayName>CFGR1</displayName>
          <description>CFGR1 Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x300320</resetValue>
          <fields>
            <field>
                <name>RPTLEN</name>
                <description>RPTLEN field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>REV2</name>
                <description>REV2 field description</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CTRL_BOOST</name>
                <description>CTRL_BOOST field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SOCIF_CFG</name>
                <description>SOCIF_CFG field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PCLK_PSC</name>
                <description>PCLK_PSC field description</description>
                <bitOffset>5</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>VCM_CTRL</name>
                <description>VCM_CTRL field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>INJ_MODE</name>
                <description>INJ_MODE field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>REFNSEL</name>
                <description>REFNSEL field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DUMMY</name>
                <description>DUMMY field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>REFPSEL</name>
                <description>REFPSEL field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>CFGR2 Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x104</resetValue>
          <fields>
            <field>
                <name>AVGR_OVSS</name>
                <description>AVGR_OVSS field description</description>
                <bitOffset>21</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>AVGR_OVSR</name>
                <description>AVGR_OVSR field description</description>
                <bitOffset>18</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>AVGEN</name>
                <description>AVGEN field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>WAIT</name>
                <description>WAIT field description</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>AUTO_SCAN</name>
                <description>AUTO_SCAN field description</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CONT_MOD</name>
                <description>CONT_MOD field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVRM</name>
                <description>OVRM field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SCAN_DIR</name>
                <description>SCAN_DIR field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DMAEN</name>
                <description>DMAEN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSR</name>
          <displayName>OSR</displayName>
          <description>OSR Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x880088</resetValue>
          <fields>
            <field>
                <name>CALI_EN</name>
                <description>CALI_EN field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OS_CALI_SLOW</name>
                <description>OS_CALI_SLOW field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OS_CALI_FAST</name>
                <description>OS_CALI_FAST field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_SR</name>
          <displayName>ACQ_SR</displayName>
          <description>ACQ_SR Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>REQ</name>
                <description>REQ field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ_SACR</name>
          <displayName>ACQ_SACR</displayName>
          <description>ACQ_SACR Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CHEN</name>
                <description>CHEN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HLTR</name>
          <displayName>HLTR</displayName>
          <description>HLTR Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x8000100</resetValue>
          <fields>
            <field>
                <name>AWD_HT</name>
                <description>AWD_HT field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>AWD_LT</name>
                <description>AWD_LT field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AWDCR</name>
          <displayName>AWDCR</displayName>
          <description>AWDCR Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CHEN</name>
                <description>CHEN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ0_CR</name>
          <displayName>ACQ0_CR</displayName>
          <description>ACQ0_CR Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
                <name>CHSEL</name>
                <description>CHSEL field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TRIGSEL</name>
                <description>TRIGSEL field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SMTS</name>
                <description>SMTS field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ1_CR</name>
          <displayName>ACQ1_CR</displayName>
          <description>ACQ1_CR Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
                <name>CHSEL</name>
                <description>CHSEL field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TRIGSEL</name>
                <description>TRIGSEL field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SMTS</name>
                <description>SMTS field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACQ2_CR</name>
          <displayName>ACQ2_CR</displayName>
          <description>ACQ2_CR Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
                <name>CHSEL</name>
                <description>CHSEL field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TRIGSEL</name>
                <description>TRIGSEL field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SMTS</name>
                <description>SMTS field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
