Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
      </registers>
    </peripheral>
    <peripheral>
      <name>CLM0</name>
      <description>CLM0 module information</description>
      <groupName>CLM</groupName>
      <headerStructName>CLM</headerStructName>
      <baseAddress>0x4001C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>CR Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <fields>
            <field>
                <name>TOREN</name>
                <description>TOREN field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>MODE</name>
                <description>MODE field description</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>UDFIE</name>
                <description>UDFIE field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVFIE</name>
                <description>OVFIE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>MONIE</name>
                <description>MONIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EN</name>
                <description>EN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>CFGR Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x2000</resetValue>
          <fields>
            <field>
                <name>REF_CYC</name>
                <description>REF_CYC field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>MONSEL</name>
                <description>MONSEL field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTR</name>
          <displayName>CNTR</displayName>
          <description>CNTR Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CNT</name>
                <description>CNT field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>ISR Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>UDF</name>
                <description>UDF field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVF</name>
                <description>OVF field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>MONIF</name>
                <description>MONIF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPH</name>
          <displayName>CMPH</displayName>
          <description>CMPH Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFF0000</resetValue>
          <fields>
            <field>
                <name>CMPH</name>
                <description>CMPH field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPL</name>
          <displayName>CMPL</displayName>
          <description>CMPL Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
                <name>CMPL</name>
                <description>CMPL field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOCFGR</name>
          <displayName>TOCFGR</displayName>
          <description>TOCFGR Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x800080</resetValue>
          <fields>
            <field>
                <name>LIMIT</name>
                <description>LIMIT field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PSC</name>
                <description>PSC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
