Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>GTSTCFG</name>
          <displayName>GTSTCFG</displayName>
          <description>GTSTCFG Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RTMPS</name>
                <description>RTMPS field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTSTCTR</name>
          <displayName>GTSTCTR</displayName>
          <description>GTSTCTR Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RTME</name>
                <description>RTME field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GFDCFG</name>
          <displayName>GFDCFG</displayName>
          <description>GFDCFG Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>TSCCFG</name>
                <description>TSCCFG field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>RPED</name>
                <description>RPED field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GLOCKK</name>
          <displayName>GLOCKK</displayName>
          <description>GLOCKK Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>LOCK</name>
                <description>LOCK field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLIGNENT</name>
          <displayName>GAFLIGNENT</displayName>
          <description>GAFLIGNENT Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>IRN</name>
                <description>IRN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLIGNCTR</name>
          <displayName>GAFLIGNCTR</displayName>
          <description>GAFLIGNCTR Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>KEY</name>
                <description>KEY field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>IREN</name>
                <description>IREN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLECTR</name>
          <displayName>GPFLECTR</displayName>
          <description>GPFLECTR Register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>PFLDAE</name>
                <description>PFLDAE field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLCFG</name>
          <displayName>GPFLCFG</displayName>
          <description>GPFLCFG Register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RNC</name>
                <description>RNC field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRSTC</name>
          <displayName>GRSTC</displayName>
          <description>GRSTC Register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>KEY</name>
                <description>KEY field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SRST</name>
                <description>SRST field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKIER</name>
          <displayName>WKIER</displayName>
          <description>WKIER Register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CFD0WKIE</name>
                <description>CFD0WKIE field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CFD0WKEN</name>
                <description>CFD0WKEN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKISR</name>
          <displayName>WKISR</displayName>
          <description>WKISR Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CFD0WKIF</name>
                <description>CFD0WKIF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0DCFG</name>
          <displayName>C0DCFG</displayName>
          <description>C0DCFG Register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DSJW</name>
                <description>DSJW field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DTSEG2</name>
                <description>DTSEG2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DTSEG1</name>
                <description>DTSEG1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DBRP</name>
                <description>DBRP field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0FDCFG</name>
          <displayName>C0FDCFG</displayName>
          <description>C0FDCFG Register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CLOE</name>
                <description>CLOE field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>REFE</name>
                <description>REFE field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>FDOE</name>
                <description>FDOE field description</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TDCO</name>
                <description>TDCO field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>RPNMD</name>
                <description>RPNMD field description</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>ESIC</name>
                <description>ESIC field description</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TDCE</name>
                <description>TDCE field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TDCOC</name>
                <description>TDCOC field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EOCCFG</name>
                <description>EOCCFG field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0FDCTR</name>
          <displayName>C0FDCTR</displayName>
          <description>C0FDCTR Register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>KEY</name>
                <description>KEY field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PNMDC</name>
                <description>PNMDC field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SOCCLR</name>
                <description>SOCCLR field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EOCCLR</name>
                <description>EOCCLR field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0FDSTS</name>
          <displayName>C0FDSTS</displayName>
          <description>C0FDSTS Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>SOC</name>
                <description>SOC field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EOC</name>
                <description>EOC field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TDCVF</name>
                <description>TDCVF field description</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PNSTS</name>
                <description>PNSTS field description</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SOCO</name>
                <description>SOCO field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EOCO</name>
                <description>EOCO field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TDCR</name>
                <description>TDCR field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0FDCRC</name>
          <displayName>C0FDCRC</displayName>
          <description>C0FDCRC Register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>SCNT</name>
                <description>SCNT field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CRCREG</name>
                <description>CRCREG field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>21</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLID0</name>
          <displayName>GAFLID0</displayName>
          <description>GAFLID0 Register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDE</name>
                <description>GAFLIDE field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTR</name>
                <description>GAFLRTR field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLLB</name>
                <description>GAFLLB field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLID</name>
                <description>GAFLID field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLID1</name>
          <displayName>GAFLID1</displayName>
          <description>GAFLID1 Register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDE</name>
                <description>GAFLIDE field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTR</name>
                <description>GAFLRTR field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLLB</name>
                <description>GAFLLB field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLID</name>
                <description>GAFLID field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLID2</name>
          <displayName>GAFLID2</displayName>
          <description>GAFLID2 Register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDE</name>
                <description>GAFLIDE field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTR</name>
                <description>GAFLRTR field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLLB</name>
                <description>GAFLLB field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLID</name>
                <description>GAFLID field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLID3</name>
          <displayName>GAFLID3</displayName>
          <description>GAFLID3 Register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDE</name>
                <description>GAFLIDE field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTR</name>
                <description>GAFLRTR field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLLB</name>
                <description>GAFLLB field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLID</name>
                <description>GAFLID field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
