Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>GAFLM4</name>
          <displayName>GAFLM4</displayName>
          <description>GAFLM4 Register</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CFDGAFLM3</name>
                <description>CFDGAFLM3 field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CFDGAFLM4</name>
                <description>CFDGAFLM4 field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CFDGAFLM5</name>
                <description>CFDGAFLM5 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLM5</name>
          <displayName>GAFLM5</displayName>
          <description>GAFLM5 Register</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDEM</name>
                <description>GAFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTRM</name>
                <description>GAFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL1</name>
                <description>GAFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLM6</name>
          <displayName>GAFLM6</displayName>
          <description>GAFLM6 Register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDEM</name>
                <description>GAFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTRM</name>
                <description>GAFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL1</name>
                <description>GAFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLM7</name>
          <displayName>GAFLM7</displayName>
          <description>GAFLM7 Register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDEM</name>
                <description>GAFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTRM</name>
                <description>GAFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL1</name>
                <description>GAFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLM8</name>
          <displayName>GAFLM8</displayName>
          <description>GAFLM8 Register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDEM</name>
                <description>GAFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTRM</name>
                <description>GAFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL1</name>
                <description>GAFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLM9</name>
          <displayName>GAFLM9</displayName>
          <description>GAFLM9 Register</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDEM</name>
                <description>GAFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTRM</name>
                <description>GAFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL1</name>
                <description>GAFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLM10</name>
          <displayName>GAFLM10</displayName>
          <description>GAFLM10 Register</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDEM</name>
                <description>GAFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTRM</name>
                <description>GAFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL1</name>
                <description>GAFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLM11</name>
          <displayName>GAFLM11</displayName>
          <description>GAFLM11 Register</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDEM</name>
                <description>GAFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTRM</name>
                <description>GAFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL1</name>
                <description>GAFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLM12</name>
          <displayName>GAFLM12</displayName>
          <description>GAFLM12 Register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDEM</name>
                <description>GAFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTRM</name>
                <description>GAFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL1</name>
                <description>GAFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLM13</name>
          <displayName>GAFLM13</displayName>
          <description>GAFLM13 Register</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDEM</name>
                <description>GAFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTRM</name>
                <description>GAFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL1</name>
                <description>GAFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLM14</name>
          <displayName>GAFLM14</displayName>
          <description>GAFLM14 Register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDEM</name>
                <description>GAFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTRM</name>
                <description>GAFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL1</name>
                <description>GAFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLM15</name>
          <displayName>GAFLM15</displayName>
          <description>GAFLM15 Register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLIDEM</name>
                <description>GAFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRTRM</name>
                <description>GAFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL1</name>
                <description>GAFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIDM</name>
                <description>GAFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLP0R0</name>
          <displayName>GAFLP0R0</displayName>
          <description>GAFLP0R0 Register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLPTR</name>
                <description>GAFLPTR field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMV</name>
                <description>GAFLRMV field description</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMDP</name>
                <description>GAFLRMDP field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL0</name>
                <description>GAFLIFL0 field description</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLDLC</name>
                <description>GAFLDLC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLP0R1</name>
          <displayName>GAFLP0R1</displayName>
          <description>GAFLP0R1 Register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLPTR</name>
                <description>GAFLPTR field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMV</name>
                <description>GAFLRMV field description</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMDP</name>
                <description>GAFLRMDP field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL0</name>
                <description>GAFLIFL0 field description</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLDLC</name>
                <description>GAFLDLC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLP0R2</name>
          <displayName>GAFLP0R2</displayName>
          <description>GAFLP0R2 Register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLPTR</name>
                <description>GAFLPTR field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMV</name>
                <description>GAFLRMV field description</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMDP</name>
                <description>GAFLRMDP field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL0</name>
                <description>GAFLIFL0 field description</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLDLC</name>
                <description>GAFLDLC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
