Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>GAFLP1R13</name>
          <displayName>GAFLP1R13</displayName>
          <description>GAFLP1R13 Register</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLPTR</name>
                <description>GAFLPTR field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMV</name>
                <description>GAFLRMV field description</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMDP</name>
                <description>GAFLRMDP field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL0</name>
                <description>GAFLIFL0 field description</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLDLC</name>
                <description>GAFLDLC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLP1R14</name>
          <displayName>GAFLP1R14</displayName>
          <description>GAFLP1R14 Register</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLPTR</name>
                <description>GAFLPTR field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMV</name>
                <description>GAFLRMV field description</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMDP</name>
                <description>GAFLRMDP field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL0</name>
                <description>GAFLIFL0 field description</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLDLC</name>
                <description>GAFLDLC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GAFLP1R15</name>
          <displayName>GAFLP1R15</displayName>
          <description>GAFLP1R15 Register</description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GAFLPTR</name>
                <description>GAFLPTR field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMV</name>
                <description>GAFLRMV field description</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLRMDP</name>
                <description>GAFLRMDP field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLIFL0</name>
                <description>GAFLIFL0 field description</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GAFLDLC</name>
                <description>GAFLDLC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLID0</name>
          <displayName>GPFLID0</displayName>
          <description>GPFLID0 Register</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GPFLIDE</name>
                <description>GPFLIDE field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRTR</name>
                <description>GPFLRTR field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLLB</name>
                <description>GPFLLB field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLID</name>
                <description>GPFLID field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLM0</name>
          <displayName>GPFLM0</displayName>
          <description>GPFLM0 Register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GPFLIDEM</name>
                <description>GPFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRTRM</name>
                <description>GPFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLIFL1</name>
                <description>GPFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLIDM</name>
                <description>GPFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLP0R0</name>
          <displayName>GPFLP0R0</displayName>
          <description>GPFLP0R0 Register</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GPFLPTR</name>
                <description>GPFLPTR field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRMV</name>
                <description>GPFLRMV field description</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRMDP</name>
                <description>GPFLRMDP field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLIFL0</name>
                <description>GPFLIFL0 field description</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLDLC</name>
                <description>GPFLDLC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLP1R0</name>
          <displayName>GPFLP1R0</displayName>
          <description>GPFLP1R0 Register</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GPFLPTR</name>
                <description>GPFLPTR field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>23</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLFDP</name>
                <description>GPFLFDP field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLFDPL</name>
                <description>GPFLFDPL field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLPT0</name>
          <displayName>GPFLPT0</displayName>
          <description>GPFLPT0 Register</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GPFLANDOR</name>
                <description>GPFLANDOR field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRANG0</name>
                <description>GPFLRANG0 field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLOUT0</name>
                <description>GPFLOUT0 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLOFFSET0</name>
                <description>GPFLOFFSET0 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRANG1</name>
                <description>GPFLRANG1 field description</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLOUT1</name>
                <description>GPFLOUT1 field description</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLOFFSET1</name>
                <description>GPFLOFFSET1 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLPD0R0</name>
          <displayName>GPFLPD0R0</displayName>
          <description>GPFLPD0R0 Register</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>FDATA</name>
                <description>FDATA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CANFD_GPFLPM0R0</name>
          <displayName>CANFD_GPFLPM0R0</displayName>
          <description>CANFD_GPFLPM0R0 Register</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>FMASK</name>
                <description>FMASK field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLPD1R0</name>
          <displayName>GPFLPD1R0</displayName>
          <description>GPFLPD1R0 Register</description>
          <addressOffset>0x23C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>FDATA</name>
                <description>FDATA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLPM1R0</name>
          <displayName>GPFLPM1R0</displayName>
          <description>GPFLPM1R0 Register</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>FMASK</name>
                <description>FMASK field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLID1</name>
          <displayName>GPFLID1</displayName>
          <description>GPFLID1 Register</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GPFLIDE</name>
                <description>GPFLIDE field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRTR</name>
                <description>GPFLRTR field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLLB</name>
                <description>GPFLLB field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLID</name>
                <description>GPFLID field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLM1</name>
          <displayName>GPFLM1</displayName>
          <description>GPFLM1 Register</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GPFLIDEM</name>
                <description>GPFLIDEM field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRTRM</name>
                <description>GPFLRTRM field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLIFL1</name>
                <description>GPFLIFL1 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLIDM</name>
                <description>GPFLIDM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLP0R1</name>
          <displayName>GPFLP0R1</displayName>
          <description>GPFLP0R1 Register</description>
          <addressOffset>0x24C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GPFLPTR</name>
                <description>GPFLPTR field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRMV</name>
                <description>GPFLRMV field description</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRMDP</name>
                <description>GPFLRMDP field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLIFL0</name>
                <description>GPFLIFL0 field description</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLDLC</name>
                <description>GPFLDLC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLP1R1</name>
          <displayName>GPFLP1R1</displayName>
          <description>GPFLP1R1 Register</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GPFLPTR</name>
                <description>GPFLPTR field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>23</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLFDP</name>
                <description>GPFLFDP field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLFDPL</name>
                <description>GPFLFDPL field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
