Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>GPFLPT1</name>
          <displayName>GPFLPT1</displayName>
          <description>GPFLPT1 Register</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>GPFLANDOR</name>
                <description>GPFLANDOR field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRANG0</name>
                <description>GPFLRANG0 field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLOUT0</name>
                <description>GPFLOUT0 field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLOFFSET0</name>
                <description>GPFLOFFSET0 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLRANG1</name>
                <description>GPFLRANG1 field description</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLOUT1</name>
                <description>GPFLOUT1 field description</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>GPFLOFFSET1</name>
                <description>GPFLOFFSET1 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLPD0R1</name>
          <displayName>GPFLPD0R1</displayName>
          <description>GPFLPD0R1 Register</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>FDATA</name>
                <description>FDATA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLPM0R1</name>
          <displayName>GPFLPM0R1</displayName>
          <description>GPFLPM0R1 Register</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>FMASK</name>
                <description>FMASK field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLPD1R1</name>
          <displayName>GPFLPD1R1</displayName>
          <description>GPFLPD1R1 Register</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>FDATA</name>
                <description>FDATA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPFLPM1R1</name>
          <displayName>GPFLPM1R1</displayName>
          <description>GPFLPM1R1 Register</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>FMASK</name>
                <description>FMASK field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC0</name>
          <displayName>RPGACC0</displayName>
          <description>RPGACC0 Register</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC1</name>
          <displayName>RPGACC1</displayName>
          <description>RPGACC1 Register</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC2</name>
          <displayName>RPGACC2</displayName>
          <description>RPGACC2 Register</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC3</name>
          <displayName>RPGACC3</displayName>
          <description>RPGACC3 Register</description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC4</name>
          <displayName>RPGACC4</displayName>
          <description>RPGACC4 Register</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC5</name>
          <displayName>RPGACC5</displayName>
          <description>RPGACC5 Register</description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC6</name>
          <displayName>RPGACC6</displayName>
          <description>RPGACC6 Register</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC7</name>
          <displayName>RPGACC7</displayName>
          <description>RPGACC7 Register</description>
          <addressOffset>0x29C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC8</name>
          <displayName>RPGACC8</displayName>
          <description>RPGACC8 Register</description>
          <addressOffset>0x2A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC9</name>
          <displayName>RPGACC9</displayName>
          <description>RPGACC9 Register</description>
          <addressOffset>0x2A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC10</name>
          <displayName>RPGACC10</displayName>
          <description>RPGACC10 Register</description>
          <addressOffset>0x2A8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC11</name>
          <displayName>RPGACC11</displayName>
          <description>RPGACC11 Register</description>
          <addressOffset>0x2AC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC12</name>
          <displayName>RPGACC12</displayName>
          <description>RPGACC12 Register</description>
          <addressOffset>0x2B0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC13</name>
          <displayName>RPGACC13</displayName>
          <description>RPGACC13 Register</description>
          <addressOffset>0x2B4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC14</name>
          <displayName>RPGACC14</displayName>
          <description>RPGACC14 Register</description>
          <addressOffset>0x2B8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC15</name>
          <displayName>RPGACC15</displayName>
          <description>RPGACC15 Register</description>
          <addressOffset>0x2BC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC16</name>
          <displayName>RPGACC16</displayName>
          <description>RPGACC16 Register</description>
          <addressOffset>0x2C0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC17</name>
          <displayName>RPGACC17</displayName>
          <description>RPGACC17 Register</description>
          <addressOffset>0x2C4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC18</name>
          <displayName>RPGACC18</displayName>
          <description>RPGACC18 Register</description>
          <addressOffset>0x2C8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC19</name>
          <displayName>RPGACC19</displayName>
          <description>RPGACC19 Register</description>
          <addressOffset>0x2CC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC20</name>
          <displayName>RPGACC20</displayName>
          <description>RPGACC20 Register</description>
          <addressOffset>0x2D0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC21</name>
          <displayName>RPGACC21</displayName>
          <description>RPGACC21 Register</description>
          <addressOffset>0x2D4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC22</name>
          <displayName>RPGACC22</displayName>
          <description>RPGACC22 Register</description>
          <addressOffset>0x2D8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC23</name>
          <displayName>RPGACC23</displayName>
          <description>RPGACC23 Register</description>
          <addressOffset>0x2DC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC24</name>
          <displayName>RPGACC24</displayName>
          <description>RPGACC24 Register</description>
          <addressOffset>0x2E0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC25</name>
          <displayName>RPGACC25</displayName>
          <description>RPGACC25 Register</description>
          <addressOffset>0x2E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC26</name>
          <displayName>RPGACC26</displayName>
          <description>RPGACC26 Register</description>
          <addressOffset>0x2E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC27</name>
          <displayName>RPGACC27</displayName>
          <description>RPGACC27 Register</description>
          <addressOffset>0x2EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RPGACC28</name>
          <displayName>RPGACC28</displayName>
          <description>RPGACC28 Register</description>
          <addressOffset>0x2F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RDTA</name>
                <description>RDTA field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
