Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>CFDF8</name>
          <displayName>CFDF8</displayName>
          <description>CFDF8 Register</description>
          <addressOffset>0x5E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDF9</name>
          <displayName>CFDF9</displayName>
          <description>CFDF9 Register</description>
          <addressOffset>0x5E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDF10</name>
          <displayName>CFDF10</displayName>
          <description>CFDF10 Register</description>
          <addressOffset>0x5EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDF11</name>
          <displayName>CFDF11</displayName>
          <description>CFDF11 Register</description>
          <addressOffset>0x5F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDF12</name>
          <displayName>CFDF12</displayName>
          <description>CFDF12 Register</description>
          <addressOffset>0x5F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDF13</name>
          <displayName>CFDF13</displayName>
          <description>CFDF13 Register</description>
          <addressOffset>0x5F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDF14</name>
          <displayName>CFDF14</displayName>
          <description>CFDF14 Register</description>
          <addressOffset>0x5FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDF15</name>
          <displayName>CFDF15</displayName>
          <description>CFDF15 Register</description>
          <addressOffset>0x600</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0ID</name>
          <displayName>TM0ID</displayName>
          <description>TM0ID Register</description>
          <addressOffset>0x604</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>IDE</name>
                <description>IDE field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>RTR</name>
                <description>RTR field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ID</name>
                <description>ID field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0PTR</name>
          <displayName>TM0PTR</displayName>
          <description>TM0PTR Register</description>
          <addressOffset>0x608</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DLC</name>
                <description>DLC field description</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>TS</name>
                <description>TS field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0FDSTS</name>
          <displayName>TM0FDSTS</displayName>
          <description>TM0FDSTS Register</description>
          <addressOffset>0x60C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>PTR</name>
                <description>PTR field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>IFL</name>
                <description>IFL field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>FDF</name>
                <description>FDF field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>BRS</name>
                <description>BRS field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ESI</name>
                <description>ESI field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF0</name>
          <displayName>TM0DF0</displayName>
          <description>TM0DF0 Register</description>
          <addressOffset>0x610</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF1</name>
          <displayName>TM0DF1</displayName>
          <description>TM0DF1 Register</description>
          <addressOffset>0x614</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF2</name>
          <displayName>TM0DF2</displayName>
          <description>TM0DF2 Register</description>
          <addressOffset>0x618</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF3</name>
          <displayName>TM0DF3</displayName>
          <description>TM0DF3 Register</description>
          <addressOffset>0x61C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF4</name>
          <displayName>TM0DF4</displayName>
          <description>TM0DF4 Register</description>
          <addressOffset>0x620</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
