Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>TM0DF5</name>
          <displayName>TM0DF5</displayName>
          <description>TM0DF5 Register</description>
          <addressOffset>0x624</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF6</name>
          <displayName>TM0DF6</displayName>
          <description>TM0DF6 Register</description>
          <addressOffset>0x628</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF7</name>
          <displayName>TM0DF7</displayName>
          <description>TM0DF7 Register</description>
          <addressOffset>0x62C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF8</name>
          <displayName>TM0DF8</displayName>
          <description>TM0DF8 Register</description>
          <addressOffset>0x630</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF9</name>
          <displayName>TM0DF9</displayName>
          <description>TM0DF9 Register</description>
          <addressOffset>0x634</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF10</name>
          <displayName>TM0DF10</displayName>
          <description>TM0DF10 Register</description>
          <addressOffset>0x638</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF11</name>
          <displayName>TM0DF11</displayName>
          <description>TM0DF11 Register</description>
          <addressOffset>0x63C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF12</name>
          <displayName>TM0DF12</displayName>
          <description>TM0DF12 Register</description>
          <addressOffset>0x640</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF13</name>
          <displayName>TM0DF13</displayName>
          <description>TM0DF13 Register</description>
          <addressOffset>0x644</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF14</name>
          <displayName>TM0DF14</displayName>
          <description>TM0DF14 Register</description>
          <addressOffset>0x648</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM0DF15</name>
          <displayName>TM0DF15</displayName>
          <description>TM0DF15 Register</description>
          <addressOffset>0x64C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1ID</name>
          <displayName>TM1ID</displayName>
          <description>TM1ID Register</description>
          <addressOffset>0x650</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>IDE</name>
                <description>IDE field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>RTR</name>
                <description>RTR field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ID</name>
                <description>ID field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1PTR</name>
          <displayName>TM1PTR</displayName>
          <description>TM1PTR Register</description>
          <addressOffset>0x654</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DLC</name>
                <description>DLC field description</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>TS</name>
                <description>TS field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1FDSTS</name>
          <displayName>TM1FDSTS</displayName>
          <description>TM1FDSTS Register</description>
          <addressOffset>0x658</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>PTR</name>
                <description>PTR field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>IFL</name>
                <description>IFL field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>FDF</name>
                <description>FDF field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>BRS</name>
                <description>BRS field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ESI</name>
                <description>ESI field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF0</name>
          <displayName>TM1DF0</displayName>
          <description>TM1DF0 Register</description>
          <addressOffset>0x65C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF1</name>
          <displayName>TM1DF1</displayName>
          <description>TM1DF1 Register</description>
          <addressOffset>0x660</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
