Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>TM1DF2</name>
          <displayName>TM1DF2</displayName>
          <description>TM1DF2 Register</description>
          <addressOffset>0x664</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF3</name>
          <displayName>TM1DF3</displayName>
          <description>TM1DF3 Register</description>
          <addressOffset>0x668</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF4</name>
          <displayName>TM1DF4</displayName>
          <description>TM1DF4 Register</description>
          <addressOffset>0x66C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF5</name>
          <displayName>TM1DF5</displayName>
          <description>TM1DF5 Register</description>
          <addressOffset>0x670</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF6</name>
          <displayName>TM1DF6</displayName>
          <description>TM1DF6 Register</description>
          <addressOffset>0x674</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF7</name>
          <displayName>TM1DF7</displayName>
          <description>TM1DF7 Register</description>
          <addressOffset>0x678</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF8</name>
          <displayName>TM1DF8</displayName>
          <description>TM1DF8 Register</description>
          <addressOffset>0x67C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF9</name>
          <displayName>TM1DF9</displayName>
          <description>TM1DF9 Register</description>
          <addressOffset>0x680</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF10</name>
          <displayName>TM1DF10</displayName>
          <description>TM1DF10 Register</description>
          <addressOffset>0x684</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF11</name>
          <displayName>TM1DF11</displayName>
          <description>TM1DF11 Register</description>
          <addressOffset>0x688</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF12</name>
          <displayName>TM1DF12</displayName>
          <description>TM1DF12 Register</description>
          <addressOffset>0x68C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF13</name>
          <displayName>TM1DF13</displayName>
          <description>TM1DF13 Register</description>
          <addressOffset>0x690</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF14</name>
          <displayName>TM1DF14</displayName>
          <description>TM1DF14 Register</description>
          <addressOffset>0x694</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM1DF15</name>
          <displayName>TM1DF15</displayName>
          <description>TM1DF15 Register</description>
          <addressOffset>0x698</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM2ID</name>
          <displayName>TM2ID</displayName>
          <description>TM2ID Register</description>
          <addressOffset>0x69C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>IDE</name>
                <description>IDE field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>RTR</name>
                <description>RTR field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ID</name>
                <description>ID field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM2PTR</name>
          <displayName>TM2PTR</displayName>
          <description>TM2PTR Register</description>
          <addressOffset>0x6A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DLC</name>
                <description>DLC field description</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>TS</name>
                <description>TS field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
