Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>TM2DF15</name>
          <displayName>TM2DF15</displayName>
          <description>TM2DF15 Register</description>
          <addressOffset>0x6E4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3ID</name>
          <displayName>TM3ID</displayName>
          <description>TM3ID Register</description>
          <addressOffset>0x6E8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>IDE</name>
                <description>IDE field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>RTR</name>
                <description>RTR field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ID</name>
                <description>ID field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3PTR</name>
          <displayName>TM3PTR</displayName>
          <description>TM3PTR Register</description>
          <addressOffset>0x6EC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DLC</name>
                <description>DLC field description</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>TS</name>
                <description>TS field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3FDSTS</name>
          <displayName>TM3FDSTS</displayName>
          <description>TM3FDSTS Register</description>
          <addressOffset>0x6F0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>PTR</name>
                <description>PTR field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>IFL</name>
                <description>IFL field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>FDF</name>
                <description>FDF field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>BRS</name>
                <description>BRS field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ESI</name>
                <description>ESI field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF0</name>
          <displayName>TM3DF0</displayName>
          <description>TM3DF0 Register</description>
          <addressOffset>0x6F4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF1</name>
          <displayName>TM3DF1</displayName>
          <description>TM3DF1 Register</description>
          <addressOffset>0x6F8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF2</name>
          <displayName>TM3DF2</displayName>
          <description>TM3DF2 Register</description>
          <addressOffset>0x6FC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF3</name>
          <displayName>TM3DF3</displayName>
          <description>TM3DF3 Register</description>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF4</name>
          <displayName>TM3DF4</displayName>
          <description>TM3DF4 Register</description>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF5</name>
          <displayName>TM3DF5</displayName>
          <description>TM3DF5 Register</description>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF6</name>
          <displayName>TM3DF6</displayName>
          <description>TM3DF6 Register</description>
          <addressOffset>0x70C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF7</name>
          <displayName>TM3DF7</displayName>
          <description>TM3DF7 Register</description>
          <addressOffset>0x710</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF8</name>
          <displayName>TM3DF8</displayName>
          <description>TM3DF8 Register</description>
          <addressOffset>0x714</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF9</name>
          <displayName>TM3DF9</displayName>
          <description>TM3DF9 Register</description>
          <addressOffset>0x718</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF10</name>
          <displayName>TM3DF10</displayName>
          <description>TM3DF10 Register</description>
          <addressOffset>0x71C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TM3DF11</name>
          <displayName>TM3DF11</displayName>
          <description>TM3DF11 Register</description>
          <addressOffset>0x720</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DB3</name>
                <description>DB3 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB2</name>
                <description>DB2 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB1</name>
                <description>DB1 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DB0</name>
                <description>DB0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
