Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
      </registers>
    </peripheral>
    <peripheral>
      <name>FLS</name>
      <description>FLS module information</description>
      <groupName>FLS</groupName>
      <headerStructName>FLS</headerStructName>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xA0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RDCR</name>
          <displayName>RDCR</displayName>
          <description>RDCR Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DATA_WAIT</name>
                <description>DATA_WAIT field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CODE_WAIT</name>
                <description>CODE_WAIT field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCR</name>
          <displayName>PFCR</displayName>
          <description>PFCR Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EN</name>
                <description>EN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTBR</name>
          <displayName>OPTBR</displayName>
          <description>OPTBR Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x15</resetValue>
          <fields>
            <field>
                <name>IWDTSLP</name>
                <description>IWDTSLP field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>IWDTEN</name>
                <description>IWDTEN field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DBRDPEN_DATA</name>
                <description>DBRDPEN_DATA field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ACLOCKEN</name>
                <description>ACLOCKEN field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>DBRDPEN_CODE</name>
                <description>DBRDPEN_CODE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCR</name>
          <displayName>EPCR</displayName>
          <description>EPCR Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>ERTYPE</name>
                <description>ERTYPE field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PREQ</name>
                <description>PREQ field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EREQ</name>
                <description>EREQ field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY</name>
          <displayName>KEY</displayName>
          <description>KEY Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>KEY</name>
                <description>KEY field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>IER Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>LVIE</name>
                <description>LVIE field description</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OTPIE</name>
                <description>OTPIE field description</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>AUTHIE</name>
                <description>AUTHIE field description</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>KEYIE</name>
                <description>KEYIE field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CKIE</name>
                <description>CKIE field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PRDIE</name>
                <description>PRDIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>ERDIE</name>
                <description>ERDIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>ISR Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>KEYSTA</name>
                <description>KEYSTA field description</description>
                <bitOffset>17</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>LVERR</name>
                <description>LVERR field description</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OTPERR</name>
                <description>OTPERR field description</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>AUTHERR</name>
                <description>AUTHERR field description</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>KEYERR</name>
                <description>KEYERR field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CKERR</name>
                <description>CKERR field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PRD</name>
                <description>PRD field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>ERD</name>
                <description>ERD field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCISR</name>
          <displayName>ECCISR</displayName>
          <description>ECCISR Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DD</name>
                <description>DD field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CD</name>
                <description>CD field description</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DC</name>
                <description>DC field description</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CC</name>
                <description>CC field description</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>BE</name>
                <description>BE field description</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCIER</name>
          <displayName>ECCIER</displayName>
          <description>ECCIER Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DDIE</name>
                <description>DDIE field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DCIE</name>
                <description>DCIE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CDIE</name>
                <description>CDIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CCIE</name>
                <description>CCIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLS_ECCEAR</name>
          <displayName>FLS_ECCEAR</displayName>
          <description>FLS_ECCEAR Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>DATA_EAR</name>
                <description>DATA_EAR field description</description>
                <bitOffset>20</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>CODE_EAR</name>
                <description>CODE_EAR field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACLOCK1</name>
          <displayName>ACLOCK1</displayName>
          <description>ACLOCK1 Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
                <name>LOCK1</name>
                <description>LOCK1 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACLOCK2</name>
          <displayName>ACLOCK2</displayName>
          <description>ACLOCK2 Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
                <name>LOCK2</name>
                <description>LOCK2 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACLOCK3</name>
          <displayName>ACLOCK3</displayName>
          <description>ACLOCK3 Register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
                <name>LOCK3</name>
                <description>LOCK3 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEPCON</name>
          <displayName>DEPCON</displayName>
          <description>DEPCON Register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>ERTYPE</name>
                <description>ERTYPE field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PREQ</name>
                <description>PREQ field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EREQ</name>
                <description>EREQ field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DKEY</name>
          <displayName>DKEY</displayName>
          <description>DKEY Register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>FLSKEY</name>
                <description>FLSKEY field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <displayName>DIER</displayName>
          <description>DIER Register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>REV3BIT</name>
                <description>REV3BIT field description</description>
                <bitOffset>13</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>LVIE</name>
                <description>LVIE field description</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OTPIE</name>
                <description>OTPIE field description</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>AUTHIE</name>
                <description>AUTHIE field description</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>KEYIE</name>
                <description>KEYIE field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CKIE</name>
                <description>CKIE field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PRDIE</name>
                <description>PRDIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>ERDIE</name>
                <description>ERDIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DISR</name>
          <displayName>DISR</displayName>
          <description>DISR Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CONF</name>
                <description>CONF field description</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>KEYSTA</name>
                <description>KEYSTA field description</description>
                <bitOffset>17</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>LVERR</name>
                <description>LVERR field description</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>AUTHERR</name>
                <description>AUTHERR field description</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>KEYERR</name>
                <description>KEYERR field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CKERR</name>
                <description>CKERR field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PRD</name>
                <description>PRD field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>ERD</name>
                <description>ERD field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
