Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <description>GPIOB module information</description>
      <groupName>GPIO</groupName>
      <headerStructName>GPIO</headerStructName>
      <baseAddress>0x40000C40</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC</name>
      <description>GPIOC module information</description>
      <groupName>GPIO</groupName>
      <headerStructName>GPIO</headerStructName>
      <baseAddress>0x40000C80</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD</name>
      <description>GPIOD module information</description>
      <groupName>GPIO</groupName>
      <headerStructName>GPIO</headerStructName>
      <baseAddress>0x40000CC0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOE</name>
      <description>GPIOE module information</description>
      <groupName>GPIO</groupName>
      <headerStructName>GPIO</headerStructName>
      <baseAddress>0x40000D00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF</name>
      <description>GPIOF module information</description>
      <groupName>GPIO</groupName>
      <headerStructName>GPIO</headerStructName>
      <baseAddress>0x40000D40</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOG</name>
      <description>GPIOG module information</description>
      <groupName>GPIO</groupName>
      <headerStructName>GPIO</headerStructName>
      <baseAddress>0x40000D80</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOH</name>
      <description>GPIOH module information</description>
      <groupName>GPIO</groupName>
      <headerStructName>GPIO</headerStructName>
      <baseAddress>0x40000DC0</baseAddress>
    </peripheral>
    <peripheral>
      <name>I2C0</name>
      <description>I2C0 module information</description>
      <groupName>I2C</groupName>
      <headerStructName>I2C</headerStructName>
      <baseAddress>0x40015000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MSPCFGR</name>
          <displayName>MSPCFGR</displayName>
          <description>MSPCFGR Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>TOEN</name>
                <description>TOEN field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EN</name>
                <description>EN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPCR</name>
          <displayName>MSPCR</displayName>
          <description>MSPCR Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RCEN</name>
                <description>RCEN field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PEN</name>
                <description>PEN field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>RSEN</name>
                <description>RSEN field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SEN</name>
                <description>SEN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPIER</name>
          <displayName>MSPIER</displayName>
          <description>MSPIER Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>WCOLIE</name>
                <description>WCOLIE field description</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVTIE</name>
                <description>OVTIE field description</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SIE</name>
                <description>SIE field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PIE</name>
                <description>PIE field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>NACKIE</name>
                <description>NACKIE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TXIE</name>
                <description>TXIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>RXIE</name>
                <description>RXIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPISR</name>
          <displayName>MSPISR</displayName>
          <description>MSPISR Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>WCOL</name>
                <description>WCOL field description</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVT</name>
                <description>OVT field description</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SIF</name>
                <description>SIF field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>PIF</name>
                <description>PIF field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ACKSTA</name>
                <description>ACKSTA field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TXIF</name>
                <description>TXIF field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>RXIF</name>
                <description>RXIF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPSR</name>
          <displayName>MSPSR</displayName>
          <description>MSPSR Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>BUSY</name>
                <description>BUSY field description</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>RW</name>
                <description>RW field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>BF</name>
                <description>BF field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>ACKMO</name>
                <description>ACKMO field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPBGR</name>
          <displayName>MSPBGR</displayName>
          <description>MSPBGR Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x130013</resetValue>
          <fields>
            <field>
                <name>BRGH</name>
                <description>BRGH field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>BRGL</name>
                <description>BRGL field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPBUF</name>
          <displayName>MSPBUF</displayName>
          <description>MSPBUF Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>BUF</name>
                <description>BUF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPTCR</name>
          <displayName>MSPTCR</displayName>
          <description>MSPTCR Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <fields>
            <field>
                <name>SDAHD</name>
                <description>SDAHD field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPTOR</name>
          <displayName>MSPTOR</displayName>
          <description>MSPTOR Register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFFF</resetValue>
          <fields>
            <field>
                <name>TIMEOUT</name>
                <description>TIMEOUT field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
