Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C0">
      <name>I2C1</name>
      <description>I2C1 module information</description>
      <groupName>I2C</groupName>
      <headerStructName>I2C</headerStructName>
      <baseAddress>0x40015400</baseAddress>
    </peripheral>
    <peripheral>
      <name>INTMUX</name>
      <description>INTMUX module information</description>
      <groupName>INTMUX</groupName>
      <headerStructName>INTMUX</headerStructName>
      <baseAddress>0x40016000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MUX0</name>
        <description>MUX0 interrupt</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>MUX1</name>
        <description>MUX1 interrupt</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>MUX2</name>
        <description>MUX2 interrupt</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>MUX3</name>
        <description>MUX3 interrupt</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>MUX4</name>
        <description>MUX4 interrupt</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>MUX5</name>
        <description>MUX5 interrupt</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>MUX6</name>
        <description>MUX6 interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>MUX7</name>
        <description>MUX7 interrupt</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>MUX8</name>
        <description>MUX8 interrupt</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>MUX9</name>
        <description>MUX9 interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>MUX10</name>
        <description>MUX10 interrupt</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>MUX11</name>
        <description>MUX11 interrupt</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>MUX12</name>
        <description>MUX12 interrupt</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>MUX13</name>
        <description>MUX13 interrupt</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>MUX14</name>
        <description>MUX14 interrupt</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>MUX15</name>
        <description>MUX15 interrupt</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>MUX16</name>
        <description>MUX16 interrupt</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>MUX17</name>
        <description>MUX17 interrupt</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>MUX18</name>
        <description>MUX18 interrupt</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>MUX19</name>
        <description>MUX19 interrupt</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>MUX20</name>
        <description>MUX20 interrupt</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>MUX21</name>
        <description>MUX21 interrupt</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>MUX22</name>
        <description>MUX22 interrupt</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>MUX23</name>
        <description>MUX23 interrupt</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>MUX24</name>
        <description>MUX24 interrupt</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>MUX25</name>
        <description>MUX25 interrupt</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>MUX26</name>
        <description>MUX26 interrupt</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>MUX27</name>
        <description>MUX27 interrupt</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>MUX28</name>
        <description>MUX28 interrupt</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>MUX29</name>
        <description>MUX29 interrupt</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>MUX30</name>
        <description>MUX30 interrupt</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>MUX31</name>
        <description>MUX31 interrupt</description>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>CR0</name>
          <displayName>CR0</displayName>
          <description>CR0 Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>MUX0SEL</name>
                <description>MUX0SEL field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>CR1 Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>MUX16SEL</name>
                <description>MUX16SEL field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
