Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
      </registers>
    </peripheral>
    <peripheral>
      <name>SENT0</name>
      <description>SENT0 module information</description>
      <groupName>SENT</groupName>
      <headerStructName>SENT</headerStructName>
      <baseAddress>0x40014800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>CR Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>RXEN</name>
                <description>RXEN field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TXEN</name>
                <description>TXEN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <displayName>CFGR</displayName>
          <description>CFGR Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x600</resetValue>
          <fields>
            <field>
                <name>DFLEN</name>
                <description>DFLEN field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>FTXIE</name>
                <description>FTXIE field description</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>NTXIE</name>
                <description>NTXIE field description</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SYNCIE</name>
                <description>SYNCIE field description</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>ERRIE</name>
                <description>ERRIE field description</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>FRXIE</name>
                <description>FRXIE field description</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>NRXIE</name>
                <description>NRXIE field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>NIBCNT</name>
                <description>NIBCNT field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CRCM</name>
                <description>CRCM field description</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PPEN</name>
                <description>PPEN field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CRCEN</name>
                <description>CRCEN field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TXPOL</name>
                <description>TXPOL field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TXM</name>
                <description>TXM field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>MOD</name>
                <description>MOD field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSR</name>
          <displayName>PSR</displayName>
          <description>PSR Register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
                <name>PSC</name>
                <description>PSC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FTR</name>
          <displayName>FTR</displayName>
          <description>FTR Register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x40E</resetValue>
          <fields>
            <field>
                <name>LEN</name>
                <description>LEN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>SR Register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>NIB</name>
                <description>NIB field description</description>
                <bitOffset>19</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>RXIDLE</name>
                <description>RXIDLE field description</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PAUSE</name>
                <description>PAUSE field description</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SYNC</name>
                <description>SYNC field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SSERR</name>
                <description>SSERR field description</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>NBERR</name>
                <description>NBERR field description</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CRCERR</name>
                <description>CRCERR field description</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>NCNTERR</name>
                <description>NCNTERR field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SYNCERR</name>
                <description>SYNCERR field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>FTXF</name>
                <description>FTXF field description</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>NTXF</name>
                <description>NTXF field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SYNCF</name>
                <description>SYNCF field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>FRXF</name>
                <description>FRXF field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>NRXF</name>
                <description>NRXF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>DR Register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CRC</name>
                <description>CRC field description</description>
                <bitOffset>28</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DATA6</name>
                <description>DATA6 field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DATA5</name>
                <description>DATA5 field description</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DATA4</name>
                <description>DATA4 field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DATA3</name>
                <description>DATA3 field description</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DATA2</name>
                <description>DATA2 field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DATA1</name>
                <description>DATA1 field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DATA0</name>
                <description>DATA0 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC</name>
          <displayName>SYNC</displayName>
          <description>SYNC Register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xF000001</resetValue>
          <fields>
            <field>
                <name>SYNCMAX</name>
                <description>SYNCMAX field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SYNCMIN</name>
                <description>SYNCMIN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RCAL</name>
          <displayName>RCAL</displayName>
          <description>RCAL Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>BASECNT</name>
                <description>BASECNT field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>RCAL</name>
                <description>RCAL field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
