Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>T0CCR</name>
          <displayName>T0CCR</displayName>
          <description>T0CCR Register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CCR</name>
                <description>CCR field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CCR</name>
          <displayName>T1CCR</displayName>
          <description>T1CCR Register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CCR</name>
                <description>CCR field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T2CCR</name>
          <displayName>T2CCR</displayName>
          <description>T2CCR Register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CCR</name>
                <description>CCR field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T3CCR</name>
          <displayName>T3CCR</displayName>
          <description>T3CCR Register</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CCR</name>
                <description>CCR field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T4CCR</name>
          <displayName>T4CCR</displayName>
          <description>T4CCR Register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CCR</name>
                <description>CCR field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T5CCR</name>
          <displayName>T5CCR</displayName>
          <description>T5CCR Register</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CCR</name>
                <description>CCR field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T6CCR</name>
          <displayName>T6CCR</displayName>
          <description>T6CCR Register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CCR</name>
                <description>CCR field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T7CCR</name>
          <displayName>T7CCR</displayName>
          <description>T7CCR Register</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CCR</name>
                <description>CCR field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T0IER</name>
          <displayName>T0IER</displayName>
          <description>T0IER Register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CMPIE</name>
                <description>CMPIE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIE</name>
                <description>CAPIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIE</name>
                <description>OVIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1IER</name>
          <displayName>T1IER</displayName>
          <description>T1IER Register</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CMPIE</name>
                <description>CMPIE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIE</name>
                <description>CAPIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIE</name>
                <description>OVIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T2IER</name>
          <displayName>T2IER</displayName>
          <description>T2IER Register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CMPIE</name>
                <description>CMPIE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIE</name>
                <description>CAPIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIE</name>
                <description>OVIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T3IER</name>
          <displayName>T3IER</displayName>
          <description>T3IER Register</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CMPIE</name>
                <description>CMPIE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIE</name>
                <description>CAPIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIE</name>
                <description>OVIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T4IER</name>
          <displayName>T4IER</displayName>
          <description>T4IER Register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CMPIE</name>
                <description>CMPIE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIE</name>
                <description>CAPIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIE</name>
                <description>OVIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T5IER</name>
          <displayName>T5IER</displayName>
          <description>T5IER Register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CMPIE</name>
                <description>CMPIE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIE</name>
                <description>CAPIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIE</name>
                <description>OVIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T6IER</name>
          <displayName>T6IER</displayName>
          <description>T6IER Register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CMPIE</name>
                <description>CMPIE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIE</name>
                <description>CAPIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIE</name>
                <description>OVIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T7IER</name>
          <displayName>T7IER</displayName>
          <description>T7IER Register</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>CMPIE</name>
                <description>CMPIE field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIE</name>
                <description>CAPIE field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIE</name>
                <description>OVIE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T0ISR</name>
          <displayName>T0ISR</displayName>
          <description>T0ISR Register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EDGESTA</name>
                <description>EDGESTA field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CMPIF</name>
                <description>CMPIF field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIF</name>
                <description>CAPIF field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIF</name>
                <description>OVIF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1ISR</name>
          <displayName>T1ISR</displayName>
          <description>T1ISR Register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EDGESTA</name>
                <description>EDGESTA field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CMPIF</name>
                <description>CMPIF field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIF</name>
                <description>CAPIF field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIF</name>
                <description>OVIF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T2ISR</name>
          <displayName>T2ISR</displayName>
          <description>T2ISR Register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EDGESTA</name>
                <description>EDGESTA field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CMPIF</name>
                <description>CMPIF field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIF</name>
                <description>CAPIF field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIF</name>
                <description>OVIF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T3ISR</name>
          <displayName>T3ISR</displayName>
          <description>T3ISR Register</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EDGESTA</name>
                <description>EDGESTA field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CMPIF</name>
                <description>CMPIF field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIF</name>
                <description>CAPIF field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIF</name>
                <description>OVIF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T4ISR</name>
          <displayName>T4ISR</displayName>
          <description>T4ISR Register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EDGESTA</name>
                <description>EDGESTA field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CMPIF</name>
                <description>CMPIF field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIF</name>
                <description>CAPIF field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIF</name>
                <description>OVIF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T5ISR</name>
          <displayName>T5ISR</displayName>
          <description>T5ISR Register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EDGESTA</name>
                <description>EDGESTA field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CMPIF</name>
                <description>CMPIF field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CAPIF</name>
                <description>CAPIF field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>OVIF</name>
                <description>OVIF field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
