Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>TEST</name>
          <displayName>TEST</displayName>
          <description>TEST Register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x40000</resetValue>
          <fields>
            <field>
                <name>SENSE_CFG</name>
                <description>SENSE_CFG field description</description>
                <bitOffset>20</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CH_IDLE_SHIELD</name>
                <description>CH_IDLE_SHIELD field description</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>R2D_CFG</name>
                <description>R2D_CFG field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SENSI_VALID</name>
                <description>SENSI_VALID field description</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTRING0</name>
          <displayName>TESTRING0</displayName>
          <description>TESTRING0 Register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EN</name>
                <description>EN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTRING1</name>
          <displayName>TESTRING1</displayName>
          <description>TESTRING1 Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EN</name>
                <description>EN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANATEST</name>
          <displayName>ANATEST</displayName>
          <description>ANATEST Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <fields>
            <field>
                <name>VCOMP_DFLT</name>
                <description>VCOMP_DFLT field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>VCOMP_DEEN</name>
                <description>VCOMP_DEEN field description</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>IDAC1_CHG_SWT</name>
                <description>IDAC1_CHG_SWT field description</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EXCAP_SEL</name>
                <description>EXCAP_SEL field description</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EXCAP_TESTEN</name>
                <description>EXCAP_TESTEN field description</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>VCOMP_FB</name>
                <description>VCOMP_FB field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>IDAC_COMP_MODE</name>
                <description>IDAC_COMP_MODE field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>VREF_BUF_ENT</name>
                <description>VREF_BUF_ENT field description</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>COMP_ENT</name>
                <description>COMP_ENT field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>IDAC2_ENT</name>
                <description>IDAC2_ENT field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>IDAC1_ENT</name>
                <description>IDAC1_ENT field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SIGMA_DELTA_ENT</name>
                <description>SIGMA_DELTA_ENT field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DEBUG_MODE</name>
                <description>DEBUG_MODE field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VREFCR</name>
          <displayName>VREFCR</displayName>
          <description>VREFCR Register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x404040</resetValue>
          <fields>
            <field>
                <name>REF_SEL</name>
                <description>REF_SEL field description</description>
                <bitOffset>27</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SHIELD_BYPBUF</name>
                <description>SHIELD_BYPBUF field description</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>VREF_BYPBUF</name>
                <description>VREF_BYPBUF field description</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>CSD_BYPBUF</name>
                <description>CSD_BYPBUF field description</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>VREF_CSDCMP_TRIM</name>
                <description>VREF_CSDCMP_TRIM field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>VREF_SHIELD_TRIM</name>
                <description>VREF_SHIELD_TRIM field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>VREF_BUF_TRIM</name>
                <description>VREF_BUF_TRIM field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHLDGNDCR0</name>
          <displayName>SHLDGNDCR0</displayName>
          <description>SHLDGNDCR0 Register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EN</name>
                <description>EN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSHLDGNDCR1</name>
          <displayName>TSHLDGNDCR1</displayName>
          <description>TSHLDGNDCR1 Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EN</name>
                <description>EN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMICR0</name>
          <displayName>EMICR0</displayName>
          <description>EMICR0 Register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>SR_CFG1</name>
                <description>SR_CFG1 field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMICR1</name>
          <displayName>EMICR1</displayName>
          <description>EMICR1 Register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>SR_CFG</name>
                <description>SR_CFG field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHLDCR0</name>
          <displayName>SHLDCR0</displayName>
          <description>SHLDCR0 Register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EN</name>
                <description>EN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHLDCR1</name>
          <displayName>SHLDCR1</displayName>
          <description>SHLDCR1 Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>EN</name>
                <description>EN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CKCR</name>
          <displayName>CKCR</displayName>
          <description>CKCR Register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>MOD_PSC</name>
                <description>MOD_PSC field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SSC_FPT</name>
                <description>SSC_FPT field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SSCEN</name>
                <description>SSCEN field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SNSSEL</name>
                <description>SNSSEL field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSSW</name>
          <displayName>PRSSW</displayName>
          <description>PRSSW Register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x8008E</resetValue>
          <fields>
            <field>
                <name>SW_WIDTH</name>
                <description>SW_WIDTH field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SW</name>
                <description>SW field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCR</name>
          <displayName>PLLCR</displayName>
          <description>PLLCR Register</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x801F3000</resetValue>
          <fields>
            <field>
                <name>RTRIM</name>
                <description>RTRIM field description</description>
                <bitOffset>27</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DB</name>
                <description>DB field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>ICFG</name>
                <description>ICFG field description</description>
                <bitOffset>12</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>LOCKED</name>
                <description>LOCKED field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
            </field>
            <field>
                <name>PRSC</name>
                <description>PRSC field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>EN</name>
                <description>EN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSSSC</name>
          <displayName>PRSSSC</displayName>
          <description>PRSSSC Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x7006A</resetValue>
          <fields>
            <field>
                <name>WIDTH</name>
                <description>WIDTH field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PRS_SSC</name>
                <description>PRS_SSC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
