Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>LINCR</name>
          <displayName>LINCR</displayName>
          <description>LINCR Register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x880</resetValue>
          <fields>
            <field>
                <name>BERS</name>
                <description>BERS field description</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>WKUP_LEN</name>
                <description>WKUP_LEN field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>SYNCEN</name>
                <description>SYNCEN field description</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>FTOEN</name>
                <description>FTOEN field description</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>BERM</name>
                <description>BERM field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>NDET_EN</name>
                <description>NDET_EN field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>WKDET_EN</name>
                <description>WKDET_EN field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TX_BF</name>
                <description>TX_BF field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TX_WKUP</name>
                <description>TX_WKUP field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LINBSR</name>
          <displayName>LINBSR</displayName>
          <description>LINBSR Register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>BAUD_SYNC</name>
                <description>BAUD_SYNC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LINFTR</name>
          <displayName>LINFTR</displayName>
          <description>LINFTR Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <fields>
            <field>
                <name>FTO</name>
                <description>FTO field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LINTTR</name>
          <displayName>LINTTR</displayName>
          <description>LINTTR Register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>IBS</name>
                <description>IBS field description</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>RSS</name>
                <description>RSS field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>BDT</name>
                <description>BDT field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>BLT</name>
                <description>BLT field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LINPSR</name>
          <displayName>LINPSR</displayName>
          <description>LINPSR Register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>PRE_SYNC</name>
                <description>PRE_SYNC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LINBKR</name>
          <displayName>LINBKR</displayName>
          <description>LINBKR Register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>BREAK_LEN</name>
                <description>BREAK_LEN field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>28</bitWidth>
                <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LINSCCR</name>
          <displayName>LINSCCR</displayName>
          <description>LINSCCR Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>LINSTC</name>
                <description>LINSTC field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
