Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33HT0XXA_DFP/0.0.1/SVD/FM33HT0XXA.SVD
        <register>
          <name>FFCR</name>
          <displayName>FFCR</displayName>
          <description>FFCR Register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
                <name>SFREN</name>
                <description>SFREN field description</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>ERSW</name>
                <description>ERSW field description</description>
                <bitOffset>9</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>ERSGD</name>
                <description>ERSGD field description</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>BGTEN</name>
                <description>BGTEN field description</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>REP_T</name>
                <description>REP_T field description</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>PAR</name>
                <description>PAR field description</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>FREN</name>
                <description>FREN field description</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TREPEN</name>
                <description>TREPEN field description</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>RREPEN</name>
                <description>RREPEN field description</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>DICONV</name>
                <description>DICONV field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EGTR</name>
          <displayName>EGTR</displayName>
          <description>EGTR Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
                <name>TXEGT</name>
                <description>TXEGT field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CODR</name>
          <displayName>CODR</displayName>
          <description>CODR Register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
                <name>CLKDIV</name>
                <description>CLKDIV field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART6">
      <name>UART7</name>
      <description>UART7 module information</description>
      <groupName>UART_SYN</groupName>
      <headerStructName>UART_SYN</headerStructName>
      <baseAddress>0x4001BC00</baseAddress>
    </peripheral>
    <peripheral>
      <name>UARTIR</name>
      <description>UARTIR module information</description>
      <groupName>UART</groupName>
      <headerStructName>UART</headerStructName>
      <baseAddress>0x40017C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IRCR</name>
          <displayName>IRCR</displayName>
          <description>IRCR Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xD2</resetValue>
          <fields>
            <field>
                <name>IRFLAG</name>
                <description>IRFLAG field description</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TH</name>
                <description>TH field description</description>
                <bitOffset>11</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
            </field>
            <field>
                <name>TZBRG</name>
                <description>TZBRG field description</description>
                <bitOffset>0</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
            </field>
          </fields>
        </register>
